АлогистикТест2/src/InformationRegisters/алк_ДополнительныеСведенияПоУчасткам/алк_ДополнительныеСведенияПоУчасткам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеСведенияПоУчасткам</name>
  <comment>используется в рм мастера для ввода проблем</comment>
  <resources>
    <name>Проблема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеСведенияПоУчасткам/ManagerModule.bsl
Процедура ЗаписатьДопСведения(ДатаСмены, Смена, Участок, ТЧПроблемы) Экспорт 
	
	НаборЗаписей = РегистрыСведений.алк_ДополнительныеСведенияПоУчасткам.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ДатаСмены.Установить(ДатаСмены);
	НаборЗаписей.Отбор.Смена.Установить(Смена);
	НаборЗаписей.Отбор.Участок.Установить(Участок);  
	
	НаборЗаписей.Прочитать();  
	
	НаборЗаписей.Очистить();	
	
	Для Каждого стр ИЗ ТЧПроблемы Цикл  
		
		Запись = НаборЗаписей.Добавить(); 
		
		Запись.ДатаСмены = ДатаСмены;
		Запись.Смена = Смена;
		Запись.Участок = Участок;		
		Запись.Проблема = стр.Проблема;
		
		Запись.НомерЗаписи = стр.НомерСтроки;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(ИСТИНА);	
	
КонецПроцедуры  

Функция ВернутьПроблемыУчастка(ДатаСмены, Смена, Участок) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ДополнительныеСведенияПоУчасткам.НомерЗаписи КАК НомерСтроки,
	               |	алк_ДополнительныеСведенияПоУчасткам.Проблема КАК Проблема
	               |ИЗ
	               |	РегистрСведений.алк_ДополнительныеСведенияПоУчасткам КАК алк_ДополнительныеСведенияПоУчасткам
	               |ГДЕ
	               |	алк_ДополнительныеСведенияПоУчасткам.ДатаСмены = &ДатаСмены
	               |	И алк_ДополнительныеСведенияПоУчасткам.Смена = &Смена
	               |	И алк_ДополнительныеСведенияПоУчасткам.Участок = &Участок";
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Участок", Участок); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
